In [1]:
import pandas as pd

In [3]:
ser = pd.Series([100, "foo", 300, "bar", 500], ["tom", "bob", "nancy", "dan", "eric"])

In [4]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [6]:
ser.loc[["bob", 'nancy']]

bob      foo
nancy    300
dtype: object

In [7]:
ser[[4, 3, 1]]

eric    500
dan     bar
bob     foo
dtype: object

In [8]:
ser.iloc[2]

300

In [9]:
'bob' in ser

True

In [10]:
300 in ser

False

In [11]:
ser * 2

tom         200
bob      foofoo
nancy       600
dan      barbar
eric       1000
dtype: object

In [15]:
ser[['tom', 'nancy']] ** 2

tom      10000
nancy    90000
dtype: object

In [16]:
ser[[0, 2]] ** 2

tom      10000
nancy    90000
dtype: object

In [17]:
d = {'one': pd.Series([100., 200., 300.], ['apple', 'ball', 'clock']),
    'two': pd.Series([111., 222., 333., 4444.],['apple', 'ball', 'cerill', 'dancy'])}

In [18]:
df = pd.DataFrame(d)
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [19]:
print(df)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [20]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [21]:
df.columns

Index(['one', 'two'], dtype='object')

In [22]:
pd.DataFrame(d, index = ['dancy', 'ball', 'apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [23]:
pd.DataFrame(d, index = ['dancy', 'ball', 'apple'], columns = ['two', 'five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

In [24]:
data = [{'alex':1, 'Joe':2}, {'ema':5, 'dora': 10, 'alice':20}]

In [25]:
pd.DataFrame(data)

   Joe  alex  alice  dora  ema
0  2.0   1.0    NaN   NaN  NaN
1  NaN   NaN   20.0  10.0  5.0

In [26]:
pd.DataFrame(data, index=['orange', 'red'])

        Joe  alex  alice  dora  ema
orange  2.0   1.0    NaN   NaN  NaN
red     NaN   NaN   20.0  10.0  5.0

In [27]:
pd.DataFrame(data, columns=['joe', 'dora', 'alice'])

   joe  dora  alice
0  NaN   NaN    NaN
1  NaN  10.0   20.0

In [29]:
pd.DataFrame(data, columns=['joe', 'dora', 'alice'], index=['orange', 'red'])

        joe  dora  alice
orange  NaN   NaN    NaN
red     NaN  10.0   20.0

In [30]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [31]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [33]:
df.loc['apple']

one    100.0
two    111.0
Name: apple, dtype: float64

In [34]:
df['three'] = df['one'] + df['two']

In [35]:
df

          one     two  three
apple   100.0   111.0  211.0
ball    200.0   222.0  422.0
cerill    NaN   333.0    NaN
clock   300.0     NaN    NaN
dancy     NaN  4444.0    NaN

In [36]:
df['flag'] = df['one']> 250
df

          one     two  three   flag
apple   100.0   111.0  211.0  False
ball    200.0   222.0  422.0  False
cerill    NaN   333.0    NaN  False
clock   300.0     NaN    NaN   True
dancy     NaN  4444.0    NaN  False

In [37]:
three = df.pop('three')

In [38]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [39]:
three

apple     211.0
ball      422.0
cerill      NaN
clock       NaN
dancy       NaN
Name: three, dtype: float64

In [40]:
del df['two']

In [41]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [42]:
df.insert(2, 'copy_of_one', df['one'])
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
clock   300.0   True        300.0
dancy     NaN  False          NaN

In [46]:
df.insert(2, 'copy_of_flag', df['flag'])
df

          one   flag  copy_of_flag  copy_of_one  one_upper_half
apple   100.0  False         False        100.0           100.0
ball    200.0  False         False        200.0           200.0
cerill    NaN  False         False          NaN             NaN
clock   300.0   True          True        300.0             NaN
dancy     NaN  False         False          NaN             NaN

In [43]:
df['one_upper_half'] = df['one'][:2]

In [44]:
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

In [51]:
df.drop(['apple', "ball"], axis=0)

          one   flag  copy_of_flag  copy_of_one  one_upper_half
cerill    NaN  False         False          NaN             NaN
clock   300.0   True          True        300.0             NaN
dancy     NaN  False         False          NaN             NaN

In [52]:
df

          one   flag  copy_of_flag  copy_of_one  one_upper_half
apple   100.0  False         False        100.0           100.0
ball    200.0  False         False        200.0           200.0
cerill    NaN  False         False          NaN             NaN
clock   300.0   True          True        300.0             NaN
dancy     NaN  False         False          NaN             NaN